{
    "PrincetonUndergrad": {
        "title": "Princeton University",
        "date": "September 2019 - May 2023",
        "position": "Bachelor of Science and Engineering in Computer Science",
        "location": "Princeton, New Jersey",
        "icon": "Princeton",
        "link": "https://www.cs.princeton.edu/",
        "description":[
            "Advisor: Professor Danqi Chen",
            "Thesis: \"How to answer a question? Rethinking Open-Domain Question Answering with Large Language Models\"",
            "Relevant Coursework: Natural Language Processing, Embodied Language Understanding, Understanding Large Language Models, Advanced Computer Vision, Distributed Systems, Operating Systems, Probability and Stochastic Systems.",
            "Awards: Sharpio Prize for Academic Excellence 2021, ICPC North America Finalist 2021"
        ]
    },
    "Meta2022":{
        "title": "Meta Reality Labs",
        "date": "May 2022 - August 2022",
        "position": "Software Engineering Intern",
        "location": "Seattle/Redmond, Washington",
        "icon": "RealityLabs",
        "link": "https://about.facebook.com/realitylabs/",
        "description":[
            "Interned on the Facebook Assistant AI Understanding team at Meta Reality Labs. Worked on Automatic Speech Recognition(ASR) and Natural Language Understanding(NLU).",
            "Implemented data augmentation interface in the internal Automatic Speech Recognition (ASR) & Natural Language Understanding (NLU) library using PyTorch for augmentation in both the audio and the text dimension.",
"Achieved more than 80% gradient compression rate with less than 5% drop in performance on computer vision and natural language datasets like CIFAR10, CelebA, and Sent140 that are competitive with state-of-the-art FL training algorithms",
"Investigated the effectiveness of data augmentation in the audio vs. text dimension and on low-resource training sets."

        ]
    },
    "PrincetonCOS484":{
        "title": "Princeton University Computer Science Department",
        "date": "February 2022 - Present",
        "position": "COS 484: Natural Language Processing Teaching Assistant",
        "location": "Princeton, New Jersey",
        "icon": "Princeton",
        "link": "https://princeton-nlp.github.io/cos484/",
        "description":[
            "Grades the coding assignments for the class COS 484: Natural Language Processing, which had approximately 100 students, and each of the 5 homework assignments contains both a theory and coding section.",
            "Provide feedback to students' theory and coding assignments on correctness and efficiency on topics like LSTM networks and Markov Chain.",
            "Answer students' questions on class forum about general NLP subjects like generative vs. discriminative networks."
        ]
    },
    "Facebook2021":{
        "title": "Facebook AI Applied Research",
        "date": "May 2021 - August 2021",
        "position": "Software Engineering Intern",
        "location": "Menlo Park, California (Remote)",
        "icon": "Facebook",
        "link": "https://ai.facebook.com/",
        "description":[
            "Interned on the Privacy ML team at the Responsible AI org. Worked on researching and implementing sketching based gradient approximation and compression algorithm called FetchSGD in Python & PyTorch to optimize client-server communication in Federated Learning (FL) setup",
            "Achieved more than 80% gradient compression rate with less than 5% drop in performance on computer vision and natural language datasets like CIFAR10, CelebA, and Sent140 that are competitive with state-of-the-art FL training algorithms",
            "Worked closely with other engineers to refactored the code base and design new interfaces for the FL library to be more generic to accommodate new algorithms like FetchSGD"
        ]
    },
    "ResInDe":{
        "title": "RESearch INnovation DEsign(ResInDe)",
        "date": "September 2020 - Present",
        "position": "Design and Development Team Member",
        "location": "Princeton, New Jersey",
        "icon": "ResInDe",
        "link": "",
        "description":[
            "Conduct user and market research on the course selection process for college students through surveys and interviews to find ways on how to improve the current course selection app(recal.io), the course review app(princeton courses), and the concentration path app(tigerpath).",
            "Work in a team of 5 to develop a completely new course selection web application by integrating a number of apps used by students at Princeton University."
        ]
    },
    "MMC":{
        "title": "Map My Customers",
        "date": "June - August 2020",
        "position": "Machine Learning Intern",
        "location": "New York, New York (Remote)",
        "icon": "MMC",
        "link": "https://mapmycustomers.me/",
        "description": [
            "Worked full-time remotely on the product team to analyze the data collected on the web app and the mobile app since the product launched in 2014, consisting of millions of rows of data, and provided customized reports for customers",
            "Compiled and preprocessed data from the PostgresSQL database and developed PCA and SVM statistical models with 89% accuracy to predict if users will buy a subscription based on their usage during free trial period",
            "Analyzed geopoints recorded by the mobile app to design a model that predicts a user’s home/office locations and utilized the OpenStreetMaps API to obtain their addresses"
        ]
    },
    "PrincetonACM":{
        "title": "Princeton Association for Computing Machinery(ACM)",
        "date": "Spring 2020 - Present",
        "position": "Careers Chair",
        "location": "Princeton, New Jersey",
        "icon": "ACM",
        "link": "http://princetonacm.com/",
        "description":[
            "Collaborate with companies like RippleMatch and Exponent to deliver talks on career in STEM fields and technical topics",
            "Practice critical thinking skills, algorithm optimization, and data structure implementation through competitions",
                "Participate in coding workshops to improve mastery in Java and C++",
                "Compile career resources for members to help them prepare for technical interviews"
        ]
    },
    "PrincetonCOS226":{
        "title": "Princeton University Computer Science Department",
        "date": "February 2020 - May 2021",
        "position": "COS 226: Algorithms and Data Structures Grader",
        "location": "Princeton, New Jersey",
        "icon": "Princeton",
        "link": "https://www.cs.princeton.edu/courses/archive/fall20/cos226/",
        "description":[
            "Grades the coding assignments for the class COS 226: Algorithms and Data Structures, which has over 150 students per semester and 7 coding  assignments in total, each consists of hundreds of lines of code and explanations",
            "Analyze students’ codes for their efficiency, style, and clarity, and provide feedback by teaching them good coding practices and more efficient implementations of algorithms and data structures like Binary Search, Deque, and Dijkstra's"
        ]
    },
    "HappyHarvest":{
        "title": "Happy Harvest",
        "date": "June - July 2019",
        "position": "Intern",
        "location": "Shanghai, China",
        "icon": "Happy Harvest",
        "link": "http://www.famens.com/gqxx/xuehuiyuan-64814-83017037980.html",
        "description":[
            "Worked full-time in a team of 6 to develop educational software using Python to implement Natural Language Processing (e.g. Stanford CoreNLP, spacy, and NLTK) ",
            "Pre-process hundreds of paragraphs and integrate AWS Polly to convert texts to speech with adjustable playback speed that replaced the need to hire a voice actor to pre record all the voice lines",
            "Software launched in over 100 schools across China in the 2019-2020 school year"
        ]
    },
    "PlanoSenior":{
        "title": "Plano Senior High School",
        "date": "2015 - 2019",
        "position": "Student",
        "location": "Plano, Texas",
        "icon": "PSHS",
        "link": "https://www.youtube.com/watch?v=EJ2y_8eq0hI",
        "description":[
            "Achievements: Valedictorian, USA Computing Olympiad Gold Division Finalist, Honorable Mention in Bioinformatics at Dallas Regional Science and Engineering Fair, 4th in Java Programming at BPA Nationals, 1st in C++ Programming at BPA State, 2nd at Computer Science UIL Regionals, National AP Scholars",
            "Coursework: AP Calculus BC(5), AP Statistics(5), AP Physics C: Mechanics(5), AP Physics C: Electricity and Magnetism(5), AP Macroeconomics(5), AP Microeconomics(5)",
            "Extracurriculars: Mu Alpha Theta Co-President, Key Club President, Chess Club President, Science Fair Club, Junior State of America President and State Senator"
        ]
    }
}
