{
    "SophomoreSpring":{
        "title": "Princeton University 2nd Year Spring",
        "date": "February 2021 - Present",
        "position": "Bachelor's in B.S.E. Computer Science",
        "location": "Princeton, New Jersey",
        "icon": "Princeton",
        "link": "https://www.cs.princeton.edu/",
        "description":[
            "Intended certificates in Robotics and Intelligent System and Statistics and Machine Learning",
            "Coursework: Advanced Programming Techniques, Natural Language Processing, Economics and Computing, Probability and Stochastic Systems",
            "COS333 Advanced Programming Techniques: Students learn and practice common programming techniques like designing, debuggin and testing, and maintaining software by developing an app.",
            "COS484 Natural Language Processing: Covers standard frameworks for dealing with natural language as well as algorithms and techniques to solve various NLP problems, including recent deep learning approaches.(Python)",
            "COS445 Economics and Computing: Focus on mathematical and computational tools involved in the interaction of economics and computation.",
            "ORF309 Probability and Stochastic Systems: basic principles of probability; Lifetimes and reliability, Poisson processes; random walks; Brownian motion; branching processes; Markov chains."
        ]
    },
    "PrincetonCOS226":{
        "title": "Princeton University Computer Science Department",
        "date": "February 2020 - Present",
        "position": "COS 226: Algorithms and Data Structures Grader",
        "location": "Princeton, New Jersey",
        "icon": "Princeton",
        "link": "https://www.cs.princeton.edu/courses/archive/fall20/cos226/",
        "description":[
            "Grades the coding assignments for the class COS 226: Algorithms and Data Structures, which has over 150 students per semester and 7 coding  assignments in total, each consists of hundreds of lines of code and explanations",
            "Analyze students’ codes for their efficiency, style, and clarity, and provide feedback by teaching them good coding practices and more efficient implementations of algorithms and data structures like Binary Search, Deque, and Dijkstra's"
        ]
    },
    "ResInDe":{
        "title": "RESearch INnovation DEsign(ResInDe)",
        "date": "September 2020 - Present",
        "position": "Design and Development Team Member",
        "location": "Princeton, New Jersey",
        "icon": "ResInDe",
        "link": "",
        "description":[
            "Conduct user and market research on the course selection process for college students through surveys and interviews to find ways on how to improve the current course selection app(recal.io), the course review app(princeton courses), and the concentration path app(tigerpath).",
            "Work in a team of 5 to develop a completely new course selection web application by integrating a number of apps used by students at Princeton University."
        ]
    },
    "SophomoreFall":{
        "title": "Princeton University 2nd Year Fall",
        "date": "August - December 2020",
        "position": "Bachelor's in B.S.E. Computer Science",
        "location": "Princeton, New Jersey",
        "icon": "Princeton",
        "link": "https://www.cs.princeton.edu/",
        "description":[
            "Intended certificates in Robotics and Intelligent System and Statistics and Machine Learning",
            "Coursework: Operating Systems, Functional Programming, Computer Vision",
            "COS318 Operating Systems (A): Emphasis on the fundamentals of how to design and implement an operating system. (C and x86 Assembly)",
            "COS326 Functional Programming (A): Programming recursive functions over structured data types and informal reasoning by induction about the correctness of those functions. (OCaml)",
            "COS429 Computer Vision (A): Surveys a wide range of topics from level-level vision to high-level recognition. (Python)"
        ]
    },
    "MMC":{
        "title": "Map My Customers",
        "date": "June - August 2020",
        "position": "Machine Learning Intern",
        "location": "New York, New York(Remote)",
        "icon": "MMC",
        "link": "https://mapmycustomers.me/",
        "description": [
            "Worked full-time remotely on the product team to analyze the data collected on the web app and the mobile app since the product launched in 2014, consisting of millions of rows of data, and provided customized reports for customers",
            "Compiled and preprocessed data from the PostgresSQL database and developed PCA and SVM statistical models with 89% accuracy to predict if users will buy a subscription based on their usage during free trial period",
            "Analyzed geopoints recorded by the mobile app to design a model that predicts a user’s home/office locations and utilized the OpenStreetMaps API to obtain their addresses"
        ]
    },
    "PrincetonACM":{
        "title": "Princeton Association for Computing Machinery(ACM)",
        "date": "Spring 2020 - Present",
        "position": "Careers Chair",
        "location": "Princeton, New Jersey",
        "icon": "ACM",
        "link": "http://princetonacm.com/",
        "description":[
            "Collaborate with companies like RippleMatch and Exponent to deliver talks on career in STEM fields and technical topics",
            "Practice critical thinking skills, algorithm optimization, and data structure implementation through competitions",
                "Participate in coding workshops to improve mastery in Java and C++",
                "Compile career resources for members to help them prepare for technical interviews"
        ]
    },
    "PrincetonFreshmen":{
        "title": "Princeton University 1st Year",
        "date": "August 2019 - May 2020",
        "position": "Bachelor's in B.S.E. Computer Science",
        "location": "Princeton, New Jersey",
        "icon": "Princeton",
        "link": "https://www.cs.princeton.edu/",
        "description":[
            "Coursework: Algorithms and Data Structures, Introduction to Programming Systems",
            "COS226 Algorithms and Data Structures(A): Emphasis on algorithms for sorting, searching, and string processing. Other areas are covered as well: geometric algorithms, graph algorithms, and numerical algorithms. (Java)",
            "COS217 Introduction to Programming Systems(A): Modular program design, testing, debugging and performance tuning, using system calls, performance style, and assembly language and machine languages. (C and ARM Assembly)",
            "COS340 Reasoning about Computation(Pass Only): Combinatorics, probability and graph theory covered in the context of computer science applications. ",
            "Awards: 2nd Place at Citadel Terminal Live Princeton vs. Penn"
        ]
    },
    "HappyHarvest":{
        "title": "Happy Harvest",
        "date": "June - July 2019",
        "position": "Intern",
        "location": "Shanghai, China",
        "icon": "Happy Harvest",
        "link": "http://www.famens.com/gqxx/xuehuiyuan-64814-83017037980.html",
        "description":[
            "Worked full-time in a team of 6 to develop educational software using Python to implement Natural Language Processing (e.g. Stanford CoreNLP, spacy, and NLTK) ",
            "Pre-process hundreds of paragraphs and integrate AWS Polly to convert texts to speech with adjustable playback speed that replaced the need to hire a voice actor to pre record all the voice lines",
            "Software launched in over 100 schools across China in the 2019-2020 school year"
        ]
    },
    "PlanoSenior":{
        "title": "Plano Senior High School",
        "date": "2015 - 2019",
        "position": "Student",
        "location": "Plano, Texas",
        "icon": "PSHS",
        "link": "https://www.youtube.com/watch?v=EJ2y_8eq0hI",
        "description":[
            "Achievements: Valedictorian, USA Computing Olympiad Gold Division Finalist, 1st place in Microbiology at Texas Junior Academy of Science, Honorable Mention in Bioinformatics at Dallas Regional Science and Engineering Fair, 4th in Java Programming at BPA Nationals, 1st in C++ Programming at BPA State, 2nd at Computer Science UIL Regionals, National AP Scholars",
            "Coursework: AP Calculus BC(5), AP Statistics(5), AP Physics C: Mechanics(5), AP Physics C: Electricity and Magnetism(5), AP Macroeconomics(5), AP Microeconomics(5)",
            "Extracurriculars: Mu Alpha Theta Co-President, Key Club President, Chess Club President, Junior State of America President and State Senator"
        ]
    }
}
